#+TITLE: Emacs Config
#+TOC: true

** Temporary files location
#+BEGIN_SRC emacs-lisp
(setq auto-save-file-name-transformations 
`((".*", (concat user-emacs-directory "auto-save/") t)))

(setq backup-directory-alist
`((".", (concat user-emacs-directory "backups") t)))
#+END_SRC

#+RESULTS:
| . | ~/.emacs.d/backups | t |

